# ChangeDimensionSegmentFailed Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DimensionFailures..::..ChangeDimensionSegmentFailed Property
BuiltInFailures..::..DimensionFailures Class See Also
---
Can't change dimension segment to this value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ChangeDimensionSegmentFailed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ChangeDimensionSegmentFailed As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ChangeDimensionSegmentFailed {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DimensionFailures Class
Autodesk.Revit.DB Namespace